# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1.00, 1.00, 512]
  s: [1.00, 1.00, 512]
  m: [1.00, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.00, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # -P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # -P2/4
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, SEBlock, [256]]

  - [-1, 1, Conv, [512, 3, 2]]  #4 # -P3/8
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, SEBlock, [256]]

  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, SEBlock, [256]]

  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 12

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [256]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 18 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, C2f, [256]]  # 21 (P2/4-xsmall)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]  # cat head P3
  - [-1, 3, C2f, [512]]  # 24 (P3/8-small)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 27 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [512]]  # 30 (P5/32-large)


  - [[21, 24, 27, 30], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
