# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs


# Modified YOLOv8 Architecture for Improved Small Object Detection

# Backbone 
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9
# Modified YOLOv8 Head with 
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9
  - [[-1, 6], 1, Concat, [1]]  #10 cat backbone P4
  - [-1, 3, C2f, [512]]  # 11 (P4/16-medium)

  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  # - [[-1, 4], 1, Concat, [1]]  #13 cat backbone P3
  # - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 4], 1, Concat, [1]]  #16 cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/32-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18
  - [[-1, 2], 1, Concat, [1]]  # 19 cat backbone P3
  - [-1, 3, C2f, [256]]  # 20 (P3/4-very small)

  - [[12,15,18], 1, Detect, [nc]]  # Detect(P3) for very small objects

